import React from 'react';
import { Box, Text, Newline } from 'ink';

export const Banner: React.FC = () => (
  <Box flexDirection="column" marginBottom={1}>
    <Text color="magentaBright" bold>
      {'████████╗██████╗ ██╗███╗   ██╗██╗████████╗██╗   ██╗'}
      <Newline />
      {'╚══██╔══╝██╔══██╗██║████╗  ██║██║╚══██╔══╝╚██╗ ██╔╝'}
      <Newline />
      {'   ██║   ██████╔╝██║██╔██╗ ██║██║   ██║    ╚████╔╝ '}
      <Newline />
      {'   ██║   ██╔══██╗██║██║╚██╗██║██║   ██║     ╚██╔╝  '}
      <Newline />
      {'   ██║   ██║  ██║██║██║ ╚████║██║   ██║      ██║   '}
      <Newline />
      {'   ╚═╝   ╚═╝  ╚═╝╚═╝╚═╝  ╚═══╝╚═╝   ╚═╝      ╚═╝   '}
    </Text>
    <Text color="magentaBright" bold>
      {' ████████╗██████╗ ███████╗███╗   ██╗██████╗ ███████╗'}
      <Newline />
      {' ╚══██╔══╝██╔══██╗██╔════╝████╗  ██║██╔══██╗██╔════╝'}
      <Newline />
      {'    ██║   ██████╔╝█████╗  ██╔██╗ ██║██║  ██║███████╗'}
      <Newline />
      {'    ██║   ██╔══██╗██╔══╝  ██║╚██╗██║██║  ██║╚════██║'}
      <Newline />
      {'    ██║   ██║  ██║███████╗██║ ╚████║██████╔╝███████║'}
      <Newline />
      {'    ╚═╝   ╚═╝  ╚═╝╚══════╝╚═╝  ╚═══╝╚═════╝ ╚══════╝'}
    </Text>
    <Text color="gray" italic>      - A Pretty Trends Analyzer -</Text>
  </Box>
);
